<?php
//比较运算符
//结果是布尔类型
 var_dump(
   3>1,
   2<4,
   3>=1,
   4<=1
 );

//等于==&全等===
echo "'=='只比较值是否相等&===既要比较值又要比较类型";

var_dump(
  1==true,
  1=='1',
  0==false,
  0==null,
  1===true,
  1===1,
  0===false,
  1<>1,//不等于
  1!=='1'//不等于
);

echo '<hr/>';
//php7中新增的两个运算符
//结合比较运算符
var_dump(
3<=>1,//1大于
3<=>3,//0 相等
3<=>5//-1小于
);

echo '<hr/>';
//可以比较两个浮点数
var_dump(
  1.5<=>1.5
);
var_dump(
  'a'<=>'a'
);

echo '<hr/>';
//从左往右检测null
var_dump(
  true??'king'??555//:boolean true

);
//若第一个？？前为null则显示后面的

 ?>
